data/server1A/10samples/split1A-test/httperf~
httperf --print-reply --client=0/1 --server=localhost --port=8081 --uri=/test --send-buffer=4096 --recv-buffer=16384 --num-conns=10 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
RH0:HTTP/1.1 200 OK
RH0:connection: close
RH0:transfer-encoding: chunked
RH0:
RB0:Test
RS0: header 66 content 4 footer 2
RH1:HTTP/1.1 200 OK
RH1:connection: close
RH1:transfer-encoding: chunked
RH1:
RB1:Test
RS1: header 66 content 4 footer 2
RH2:HTTP/1.1 200 OK
RH2:connection: close
RH2:transfer-encoding: chunked
RH2:
RB2:Test
RS2: header 66 content 4 footer 2
RH3:HTTP/1.1 200 OK
RH3:connection: close
RH3:transfer-encoding: chunked
RH3:
RB3:Test
RS3: header 66 content 4 footer 2
RH4:HTTP/1.1 200 OK
RH4:connection: close
RH4:transfer-encoding: chunked
RH4:
RB4:Test
RS4: header 66 content 4 footer 2
RH5:HTTP/1.1 200 OK
RH5:connection: close
RH5:transfer-encoding: chunked
RH5:
RB5:Test
RS5: header 66 content 4 footer 2
RH6:HTTP/1.1 200 OK
RH6:connection: close
RH6:transfer-encoding: chunked
RH6:
RB6:Test
RS6: header 66 content 4 footer 2
RH7:HTTP/1.1 200 OK
RH7:connection: close
RH7:transfer-encoding: chunked
RH7:
RB7:Test
RS7: header 66 content 4 footer 2
RH8:HTTP/1.1 200 OK
RH8:connection: close
RH8:transfer-encoding: chunked
RH8:
RB8:Test
RS8: header 66 content 4 footer 2
RH9:HTTP/1.1 200 OK
RH9:connection: close
RH9:transfer-encoding: chunked
RH9:
RB9:Test
RS9: header 66 content 4 footer 2
Maximum connect burst length: 1

Total: connections 10 requests 10 replies 10 test-duration 0.021 s

Connection rate: 480.7 conn/s (2.1 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 0.3 avg 2.1 max 16.8 median 0.5 stddev 5.2
Connection time [ms]: connect 1.7
Connection length [replies/conn]: 1.000

Request rate: 480.7 req/s (2.1 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 0.4 transfer 0.0
Reply size [B]: header 66.0 content 4.0 footer 2.0 (total 72.0)
Reply status: 1xx=0 2xx=10 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.00 system 0.00 (user 3.9% system 18.7% total 22.6%)
Net I/O: 63.8 KB/s (0.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0